#include <iostream>
using namespace std;

int main() {
    int n;

    cout << "Введіть кількість елементів масиву: ";
    cin >> n;

    int a[100];   // оголошення масиву
    int sum = 0;  // змінна для суми квадратів

    cout << "Введіть елементи масиву:" << endl;

    // введення елементів масиву
    for(int i = 0; i < n; i++) {
        cin >> a[i];
    }

    // обчислення суми квадратів
    for(int i = 0; i < n; i++) {
        sum += a[i] * a[i];
    }

    // виведення результату
    cout << "Сума квадратів елементів масиву = " << sum << endl;

    return 0;
}